20240124062740-abstract_access_modifiers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Abstract Access Modifiers</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Abstract Access Modifiers</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd891cc8">1. Abstract Access Modifiers</a>
<ul>
<li><a href="#orgf74b362">1.1. Abstract and final</a>
<ul>
<li><a href="#org85e6a23">1.1.1. Example</a></li>
</ul>
</li>
<li><a href="#orged95728">1.2. Abstract and private</a>
<ul>
<li><a href="#org5924739">1.2.1. Example</a></li>
</ul>
</li>
<li><a href="#org1f0d480">1.3. Abstract and protected</a></li>
<li><a href="#org860c59a">1.4. Abstract and static</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd891cc8" class="outline-2">
<h2 id="orgd891cc8"><span class="section-number-2">1.</span> Abstract Access Modifiers</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf74b362" class="outline-3">
<h3 id="orgf74b362"><span class="section-number-3">1.1.</span> Abstract and final</h3>
<div class="outline-text-3" id="text-1-1">
<p>
What would happen if you marked a class or method both <code>abstract</code> and <code>final</code>?
If you mark something abstract, you intend for someone else to extend or implement it.
But if you mark something final, you are preventing anyone from extending or implementing it.
</p>

<p>
These concepts are in <b>direct conflict</b> with each other.
</p>

<p>
Due to this incompatibility, Java does not permit a class or method to be <b>marked</b> both <code>abstract</code> and <code>final</code>.
</p>
</div>

<div id="outline-container-org85e6a23" class="outline-4">
<h4 id="org85e6a23"><span class="section-number-4">1.1.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
For example, the following code snippet will not compile:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">abstract</span> <span class="org-keyword">final</span> <span class="org-keyword">class</span> <span class="org-type">Tortoise</span> {<span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>    <span class="org-keyword">public</span> <span class="org-keyword">abstract</span> <span class="org-keyword">final</span> <span class="org-type">void</span> <span class="org-function-name">walk</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgfc3e85e"></a><span class="underline">Exam Trick</span><br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
In this example, <b>neither</b> the <code>class</code> nor the <code>method declarations</code> will compile because they are marked both <code>abstract</code> and <code>final</code>.
</p>

<p>
The exam doesn’t tend to use <code>final</code> modifiers on <code>classes</code> or <code>methods</code> often, so if you see them, make sure they <b>aren’t</b> used with the <code>abstract</code> modifier.
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orged95728" class="outline-3">
<h3 id="orged95728"><span class="section-number-3">1.2.</span> Abstract and private</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A <code>method</code> <b>cannot</b> be marked as both <code>abstract</code> and <code>private</code>.
</p>

<p>
This rule makes sense if you think about it.
</p>


<p>
How would you define a subclass that implements a required method if the method is not inherited by the subclass?
</p>
</div>

<div id="outline-container-org5924739" class="outline-4">
<h4 id="org5924739"><span class="section-number-4">1.2.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
The answer is that you <b>can’t</b>, which is why the compiler will complain if you try to do the following:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Whale</span> {
    <span class="org-keyword">private</span> <span class="org-keyword">abstract</span> <span class="org-type">void</span> <span class="org-function-name">sing</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">HumpbackWhale</span> <span class="org-keyword">extends</span> <span class="org-type">Whale</span> {
    <span class="org-keyword">private</span> <span class="org-type">void</span> <span class="org-function-name">sing</span>() {
        System.out.println(<span class="org-string">"Humpback whale is singing"</span>);
    }
}
</pre>
</div>

<p>
In the above example, the abstract method <code>sing()</code> defined in the <code>parent</code> class <code>Whale</code> is not visible to the subclass <code>HumpbackWhale</code>.
Even though <code>HumpbackWhale</code> does provide an implementation, it is not considered an <b>override</b> of the <code>abstract</code> method since the <code>abstract
method</code> is not inherited.
</p>

<p>
The compiler recognizes this in the <code>parent</code> class and reports an <b>error</b> as soon as <code>private</code> and <code>abstract</code> are applied to the same method.
</p>
</div>
</div>
</div>

<div id="outline-container-org1f0d480" class="outline-3">
<h3 id="org1f0d480"><span class="section-number-3">1.3.</span> Abstract and protected</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In this modified example, the code will still <b>not</b> compile, but for a completely different reason.
If you remember the rules for <a href="20240120133450-overriding_a_method.html#ID-c67b24a4-82f7-4423-83a9-75fc1c566166">Overriding a Method</a>, the <code>subclass</code> cannot reduce the visibility of the <code>parent</code> method, <code>sing()</code>.
</p>

<p>
Because the method is declared <b>protected</b> in the <code>parent</code> class, it <b>must</b> be marked as <code>protected</code> or <code>public</code> in the <code>child</code> class.
Even with <code>abstract</code> methods, the rules for <b>overriding methods</b> must be followed.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Whale</span> {
    <span class="org-keyword">protected</span> <span class="org-keyword">abstract</span> <span class="org-type">void</span> <span class="org-function-name">sing</span>();
}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">HumpbackWhale</span> <span class="org-keyword">extends</span> <span class="org-type">Whale</span> {
    <span class="org-keyword">private</span> <span class="org-type">void</span> <span class="org-function-name">sing</span>() { <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>        System.out.println(<span class="org-string">"Humpback whale is singing"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org860c59a" class="outline-3">
<h3 id="org860c59a"><span class="section-number-3">1.4.</span> Abstract and static</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A <code>static</code> method can only be <b>hidden</b>, <b>not overridden</b>.
</p>

<p>
It is defined as belonging to the <code>class</code>, <b>not</b> an <code>instance</code> of the class.
</p>

<p>
If a <code>static</code> method <b>cannot</b> be <b>overridden</b>, then it follows that it also <b>cannot</b> be marked <code>abstract</code> since it can <b>never be implemented</b>.
</p>

<p>
For example, the following class does not compile:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Hippopotamus</span> {
    <span class="org-keyword">abstract</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">swim</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
